app/controllers/articles_controller.rb

  def user
    @tags = Tag.all
    @users = User.all
    @tag_devices = TagDevise.all
---
SELECT "tags".* FROM "tags"
SELECT "tag_devises".* FROM "tag_devises"

  def index
    @articles = Article.all
    @tags = Tag.order(like: :desc).limit(5)
    @users = User.all
    @tag_devices = TagDevise.all
---
SELECT "tag_articles".* FROM "tag_articles"
SELECT  "tags".* FROM "tags"  ORDER BY "tags"."like" DESC LIMIT 5
SELECT "users".* FROM "users"
SELECT "tag_devises".* FROM "tag_devises"

  def show
    @article = Article.find(params[:id])
    @article.views = @article.views + 1
    @article.save
    @tag = Tag.new
    @tags = Tag.all
    @tag_articles = TagArticle.all
    @tag_devises = TagDevise.all
    @users = User.all
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "views" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["views", 2], ["updated_at", "2016-07-20 14:39:46.164993"], ["id", 2]]
SELECT "tags".* FROM "tags"
SELECT "tag_articles".* FROM "tag_articles"
SELECT "tag_devises".* FROM "tag_devises"
SELECT "users".* FROM "users"

  def like
    @article = Article.find(params[:id])
    @tmp = @article.likes + 1
    @article.likes = @tmp
    @article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "likes" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["likes", 2], ["updated_at", "2016-07-20 14:40:08.265678"], ["id", 2]]

  def create
    @article = Article.new(article_params)
  @article.filename = (0...8).map { (65 + rand(26)).chr }.join + ".jpg"
		@uploaded_io = params[:article][:uploaded_file]

		File.open(Rails.root.join('public', 'images', @article.filename), 'wb') do |file|
			file.write(@uploaded_io.read)
		end

      if @article.save
---
INSERT INTO "articles" ("title", "description", "story", "views", "likes", "filename", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)