app/controllers/tags_controller.rb

  def like
    @tag = Tag.find(params[:a_id])
    @tmp = @tag.like
    @tag.like = @tmp + 1
    @tag.save
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "tags" SET "like" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["like", 1], ["updated_at", "2016-07-20 19:01:58.970588"], ["id", 0]]

  def create
    @tag = Tag.new(tag_params)
    @tag.id = Tag.count(:all)
    @tag.like = 0;
    @tag.dislike = 0;
    @article = Article.find_by_id params[:subaction]
    @tag_article = TagArticle.new
    @tag_article.tag_id = Tag.count(:all)
    @tag_article.article_id = @article.id
    @tag_article.save
    @tag_devise = TagDevise.new
    @tag_devise.devise_id = current_user.id
    @tag_devise.tag_id = Tag.count(:all)
    @tag_devise.save
---
SELECT COUNT(*) FROM "tags"
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "tag_articles" ("tag_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 0], ["article_id", 2], ["created_at", "2016-07-20 14:39:59.849117"], ["updated_at", "2016-07-20 14:39:59.849117"]]
INSERT INTO "tags" ("str", "id", "like", "dislike", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["str", "Nice tag"], ["id", 0], ["like", 0], ["dislike", 0], ["created_at", "2016-07-20 14:39:59.862499"], ["updated_at", "2016-07-20 14:39:59.862499"]]
INSERT INTO "tag_devises" ("devise_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["devise_id", 1], ["tag_id", 0], ["created_at", "2016-07-20 14:39:59.857660"], ["updated_at", "2016-07-20 14:39:59.857660"]]